{
  "de": {
    "lead_acknowledgment": {
      "title": "Lead Bestätigung",
      "template": "Vielen Dank für Ihre Anfrage bei Vorzimmerdrache. Wir haben Ihre Informationen erhalten und melden uns schnellstmöglich bei Ihnen zurück.",
      "variables": []
    },
    "appointment_confirmation": {
      "title": "Terminbestätigung",
      "template": "Ihr Termin am {date} um {time} wurde bestätigt. Wir freuen uns auf Sie! Adresse: {address}",
      "variables": ["date", "time", "address"]
    },
    "quote_sent": {
      "title": "Angebot Gesendet",
      "template": "Ihr Angebot liegt bereit. Sie können es hier einsehen: {link}. Haben Sie Fragen? Wir stehen Ihnen gerne zur Verfügung.",
      "variables": ["link"]
    },
    "material_ordered": {
      "title": "Material Bestellt",
      "template": "Gute Neuigkeiten! Die Materialien für Ihr Projekt wurden bestellt. Voraussichtliche Lieferung: {delivery_date}.",
      "variables": ["delivery_date"]
    },
    "installation_scheduled": {
      "title": "Montage Geplant",
      "template": "Die Montage Ihres Projekts ist für {date} geplant. Unsere Techniker werden sich zeitnah bei Ihnen melden.",
      "variables": ["date"]
    },
    "fallback_sms": {
      "title": "SMS Fallback",
      "template": "WhatsApp-Dienst nicht erreichbar. Nachricht: {message}",
      "variables": ["message"]
    },
    "roof_short": {
      "title": "Dach-Modus Kurz",
      "template": "🏠 Solar Vorzimmerdrache hier. Wir sind auf dem Dach bei der Montage. Kann gerade nicht telefonieren. Bitte kurz per WhatsApp antworten, dann ruf ich dich an. Danke!",
      "variables": []
    },
    "roof_friendly": {
      "title": "Dach-Modus Freundlich",
      "template": "👋 Hallo, hier ist Solar Vorzimmerdrache! Wir sind gerade auf dem Dach bei einer Montage. Hab deine Nummer gesehen und wollten dir kurz schreiben. Bitte antworte kurz hier, dann machen wir einen Termin aus. Danke!",
      "variables": []
    },
    "roof_professional": {
      "title": "Dach-Modus Professionell",
      "template": "☀️ Guten Tag, hier ist Solar Vorzimmerdrache. Unser Team befindet sich gerade auf dem Dach bei einer Montage und kann telefonisch nicht sprechen. Bitte gib uns kurz per WhatsApp Rückmeldung, dann rufen wir dich an. Vielen Dank!",
      "variables": []
    },
    "roof_customer": {
      "title": "Dach-Modus Kunde",
      "template": "🏠 Hallo {name}, hier ist Solar Vorzimmerdrache. Wir sind gerade auf dem Dach bei deiner Montage. Hab deine Nummer gesehen und schreib dir kurz. Bitte antworte hier, dann melde ich mich. Danke!",
      "variables": ["name"]
    },
    "roof_customer_project": {
      "title": "Dach-Modus Kunde mit Projekt",
      "template": "🏠 Hallo {name}, hier ist Solar Vorzimmerdrache. Wir sind gerade auf dem Dach bei deinem Projekt ({project}). Hab deine Nummer gesehen und schreib dir kurz. Bitte antworte hier, dann melde ich mich. Danke!",
      "variables": ["name", "project"]
    },
    "roof_followup": {
      "title": "Dach-Modus Follow-up",
      "template": "⏰ Hallo, hier ist Solar Vorzimmerdrache. Wir haben dir vorhin geschrieben, da wir auf dem Dach sind und nicht telefonieren können. Bitte kurz auf die WhatsApp antworten, dann können wir dir weiterhelfen. Danke!",
      "variables": []
    },
    "roof_endday": {
      "title": "Dach-Modus Tagesende",
      "template": "🌅 Hallo, hier ist Solar Vorzimmerdrache. Wir beenden heute die Dachmontage und machen uns fertig. Bitte schau kurz in die WhatsApp, wir würden uns freuen, dich kennenzulernen. Bis gleich!",
      "variables": []
    },
    "sms_roof_short": {
      "title": "SMS Dach-Modus Kurz (160 chars)",
      "template": "Solar Vorzimmerdrache: Wir sind auf dem Dach bei Montage. Kann nicht telefonieren. Bitte kurz WhatsApp oder SMS antworten. Danke!",
      "variables": [],
      "char_limit": 160
    },
    "sms_roof_friendly": {
      "title": "SMS Dach-Modus Freundlich (160 chars)",
      "template": "Solar Vorzimmerdrache: Wir sind auf dem Dach bei Montage. Hab deine Nummer gesehen. Bitte kurz WhatsApp oder SMS antworten. Danke!",
      "variables": [],
      "char_limit": 160
    },
    "sms_roof_professional": {
      "title": "SMS Dach-Modus Professionell (160 chars)",
      "template": "Solar Vorzimmerdrache: Team auf Dach bei Montage, telefonisch nicht erreichbar. Bitte kurz per WhatsApp/SMS Rückmeldung. Danke!",
      "variables": [],
      "char_limit": 160
    },
    "sms_roof_customer": {
      "title": "SMS Dach-Modus Kunde (160 chars)",
      "template": "Solar Vorzimmerdrache {name}: Wir sind auf dem Dach bei deiner Montage. Bitte kurz WhatsApp oder SMS antworten. Danke!",
      "variables": ["name"],
      "char_limit": 160
    }
  }
}
